// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// ===================================НАЧАЛО===================================
int ReadInt(string text)
{
    System.Console.WriteLine(text);
    return Convert.ToInt32(Console.ReadLine());
}

int sum(int A)
{
    
   
    int sum=0;
    while(A>0)
    {
        sum=sum+A%10;
        A=A/10;
        
    }
    return sum;
}
// -----------------------------------------------------

int a=ReadInt("Введите число");
int b=sum(a);
System.Console.WriteLine($"Сумма цифр в числе {a} = {b}");
//===================================КОНЕЦ===================================


